RetroLoft/RadioFloppy/sdkconfig.defaults
# Target: ESP32-S3 (Otronic DevKitC clone, 16 MB flash, 8 MB PSRAM)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Console on UART0 (GPIO43 TX / GPIO44 RX) via the board's USB-to-UART bridge.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200

# GPIO19/GPIO20 (native USB D-/D+) are used by the PCB for SW_NEXT and the
# buzzer. Keep the native USB Serial/JTAG out of the picture entirely.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_USJ_ENABLE_USB_SERIAL_JTAG is not set

# 1 kHz tick so short task delays (5 ms button polling) are exact.
CONFIG_FREERTOS_HZ=1000

# PSRAM, WiFi, SPI flash etc. are intentionally not enabled in this phase.

# Input monitor: pcnt_unit_get_count() is called from the IRAM GPIO ISR.
CONFIG_PCNT_CTRL_FUNC_IN_IRAM=y
# emulator_is_selected() (gpio_get_level) is called from the IRAM GPIO ISR.
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y

# Custom partition table: 4 MB factory app (embedded floppy image).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ESP32-S3R8: 8 MB octal PSRAM (holds the pre-encoded MFM tracks).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# -O2: faster flux encoder callback (RMT ISR) and track encoding at start-up.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
